homework/Lab02/combustorPimpleCFL15/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors   0;
    nCorrectors                2;
    nOuterCorrectors         100;
    turbOnFinalIterOnly       no; 
    consistent                no; 
    momentumPredictor        yes;

    outerCorrectorResidualControl
    {
        "(U|k|epsilon|p)"
        {
            relTol       0; 
            tolerance 1e-4; 
        }
    }
}

relaxationFactors
{
    fields
    {
        "p.*" 0.3;
    }
    
    equations
    {
        "U.*"                  0.7;
        "(k|omega|epsilon).*"  0.5;
    }
}
